; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-3-2-172)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	p1-0 - location
	p1-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s2)
	(at package2 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 18)
	(= (time-to-walk p1-0 s1) 18)
	(= (time-to-walk s0 p1-0) 1)
	(= (time-to-walk p1-0 s0) 1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 30)
	(= (time-to-walk p1-2 s1) 30)
	(= (time-to-walk s2 p1-2) 30)
	(= (time-to-walk p1-2 s2) 30)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 27)
	(= (time-to-drive s0 s1) 27)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 31)
	(= (time-to-drive s1 s2) 31)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 22)
	(= (time-to-drive s2 s0) 22)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s1)
	(at truck1 s2)
	(at truck2 s1)
	(at package1 s1)
	(at package2 s2)
	))

(:metric minimize (+ (* 4 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   goals met: 3 of 6
2. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   goals met: 4 of 6
3. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 3 of 6
4. (drive-truck truck3 s0 s1 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 0 to 270
   goals met: 3 of 6
5. (walk driver2 s1 p1-0)
   deleted: (at driver2 s1)
   added: (at driver2 p1-0)
   goals met: 2 of 6
6. (walk driver2 p1-0 s0)
   deleted: (at driver2 p1-0)
   added: (at driver2 s0)
   goals met: 2 of 6
7. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 6
8. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 270 to 540
   goals met: 3 of 6
9. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 4 of 6
10. (drive-truck truck3 s1 s0 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 540 to 810
   goals met: 4 of 6
11. (disembark-truck driver1 truck3 s0)
   deleted: (driving driver1 truck3)
   added: (at driver1 s0) (empty truck3)
   goals met: 5 of 6
12. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 6
13. (drive-truck truck2 s1 s2 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 810 to 1120
   goals met: 3 of 6
14. (load-truck package1 truck2 s2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 3 of 6
15. (drive-truck truck2 s2 s1 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 1120 to 1461
   goals met: 4 of 6
16. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 5 of 6
17. (unload-truck package1 truck2 s1)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 6
